In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("data_cleaning_sample.csv")

In [4]:
df.head()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019

In [ ]:
df["Age"] = df["Age"].fillna(df["Age"].median())

In [ ]:
df

In [ ]:
df.describe()

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

In [ ]:
df

In [ ]:
df.duplicated()

In [ ]:
df.drop_duplicates()

In [ ]:
df

In [ ]:
df = df.drop_duplicates()

In [ ]:
df

In [ ]:
df["Name"] = df["Name"].str.lower()

In [ ]:
df

In [ ]:
df["City"] = df["City"].str.lower()

In [ ]:
df

In [ ]:
df["City"].str.contains("Delhi", case=False)

In [ ]:
df.info()

In [ ]:
df["Age"] = df["Age"].astype("int32")

In [ ]:
df.info()

In [6]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [7]:
df["Phase"] = df["Age"].apply(lambda x : "Adult" if x > 18 else "Minor")

In [8]:
df

      Name   Age         City Gender              Email   Join Date  Phase
0    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020  Adult
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor
4    David  22.0       Mumbai      M  david@example.com  12-11-2019  Adult
5      NaN  28.0        Delhi      F     eve@domain.com         NaN  Adult
6    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
7    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor

In [9]:
gender_map = {"M": "Male", "F": "Female"}
df["Gender"] = df["Gender"].map(gender_map)

In [10]:
df

      Name   Age         City  Gender              Email   Join Date  Phase
0    Alice  25.0     New York  Female  alice@example.com  01-05-2021  Adult
1  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021  Minor
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020  Adult
3  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021  Minor
4    David  22.0       Mumbai    Male  david@example.com  12-11-2019  Adult
5      NaN  28.0        Delhi  Female     eve@domain.com         NaN  Adult
6    Alice  25.0     New York  Female  alice@example.com  01-05-2021  Adult
7    Alice  25.0     New York  Female  alice@example.com  01-05-2021  Adult
8  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021  Minor

In [11]:
gender_map = {"Male": "M", "Female": "F"}
df["Gender"] = df["Gender"].map(gender_map)

In [12]:
df

      Name   Age         City Gender              Email   Join Date  Phase
0    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020  Adult
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor
4    David  22.0       Mumbai      M  david@example.com  12-11-2019  Adult
5      NaN  28.0        Delhi      F     eve@domain.com         NaN  Adult
6    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
7    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor